<!DOCTYPE html>
<html>
<head>
	<!--- --->
    <title>Robot</title>
    <link rel="stylesheet" type="text/css" href="../css/stylesheet.css">
    <link href="https://fonts.googleapis.com/css?family=Anonymous+Pro" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css?family=Inconsolata" rel="stylesheet">
    <link rel="shortcut icon" href="../media/favicon.png">
</head>
<body onload="imgResize();numberLines()" onresize="location.reload();imgResize()">
	<div id="numbar"></div>
	<div id="content">

    <p class="header">Robot</p>
    <p class="subHeader"><i> &lt!-- D.E.N.N.I.S. --&gt</i> </p>
    <div class="gameDescription" >
  		<div class="sketchfab-embed-wrapper" align="left"><iframe id="robotModel" width="100%" height="500px" src="https://sketchfab.com/models/cef3679819004a9c84cf7942ae04dbb0/embed" frameborder="0" allowvr allowfullscreen mozallowfullscreen="true" webkitallowfullscreen="true" onmousewheel=""></iframe>
        <p style="text-align:center; font-size:13px; font-weight:normal; margin:5px; color:#4A4A4A;">
          <a href="https://sketchfab.com/models/cef3679819004a9c84cf7942ae04dbb0?utm_medium=embed&utm_source=website&utm_campain=share-popup" target="_blank" style="font-weight: bold; color: #1CAAD9;">D.E.N.N.I.S.</a>
        </p>
    </div>

      <p>Nos hackers passionn&eacute;s ont travaill&eacute; sans rel&acirc;che pendant des semaines pour compl&eacute;ter la t&acirc;che, apparemment difficile, qui leur a &eacute;t&eacute; assign&eacute;e par Anonymous. Nos hackers ont con&ccedil;u un robot nomm&eacute; D.E.N.N.I.S. capable de ramasser des pi&egrave;ces de jeu et de les lancer sur diff&eacute;rentes cibles.</p>
      <div style="display:inline-block;">
        <img id="whel" src="../media/robot/wheel.png" height="360px" width="360px" style="height:auto; max-width:100%; float:right; padding-left:10px; margin-top:20px">
        <p>La premi&egrave;re &eacute;tape consistait &agrave; d&eacute;terminer le type et la taille de roues pour notre robot et les hackers ont conclu que l&rsquo;utilisation de roues m&eacute;canums serait le meilleur choix. Suite &agrave; cette d&eacute;cision, ils ont commenc&eacute; &agrave; construire le cadre du robot en aluminium.</p>
      </div>

      <div style="padding-bottom:15px">
        <p>L'&eacute;tape suivante consistait &agrave; d&eacute;cider le m&eacute;canisme de lancement des pi&egrave;ces de jeu. Apr&egrave;s un long processus de r&eacute;flexion, nos hackers ambitieux ont conclu que la m&eacute;thode la plus efficace et pr&eacute;cise serait d'utiliser deux roues tournant en sens inverse. Mont&eacute;s &agrave; 18 pouces au-dessus du sol, les deux roues tournent &agrave; une vitesse rapide afin de pouvoir tirer les pi&egrave;ces sur une distance d&rsquo;environ 5 m&egrave;tres. Apr&egrave;s avoir tir&eacute; les pi&egrave;ces de jeu avec succ&egrave;s &agrave; l&rsquo;aide de ce m&eacute;canisme, la t&acirc;che suivante consistait &agrave; trouver une m&eacute;thode d&rsquo;alimentation du lanceur. En cr&eacute;ant un chemin avec plusieurs petites roues menant aux roues du lanceur, nos hackers ont con&ccedil;u un robot capable de tirer les pi&egrave;ces de jeu ind&eacute;pendamment de leur orientation.</p>
        <img id="shooter" src="../media/robot/shooter.JPG" style="height:auto; max-width:100%;">
      </div>

      <p>La t&acirc;che la plus difficile de nos hackers &eacute;tait de concevoir un moyen pour r&eacute;cup&eacute;rer les pi&egrave;ces du jeu. Id&eacute;alement, le m&eacute;canisme serait capable d&rsquo;alimenter le robot avec plus d'une balle &agrave; la fois pour maximiser le score du robot. En utilisant deux bacs fusionn&eacute;s ensemble, nos hackers ont con&ccedil;u une m&eacute;thode de ramassage li&eacute;e &agrave; un syst&egrave;me de poulie. Une fois que les pi&egrave;ces de jeu sont ramass&eacute;es par D.E.N.N.I.S., le m&eacute;canisme de ramassage est renvers&eacute; faisant tomber ainsi les pi&egrave;ces de jeu dans le tireur.</p>
      <p>Au cours de ce long processus, nos hackers ont fait face &agrave; plusieurs d&eacute;fis tels que la conception d&rsquo;un m&eacute;canisme pouvant lancer des pi&egrave;ces ind&eacute;pendamment de leur orientation. De plus, la rampe aux extr&eacute;mit&eacute;s du plateau de jeu s'est &eacute;galement av&eacute;r&eacute;e comme un d&eacute;fi pour D.E.N.N.I.S., car son centre de masse devait &ecirc;tre d&eacute;termin&eacute; pr&eacute;cis&eacute;ment pour s&rsquo;assurer que le robot ne bascule pas. Enfin, il &eacute;tait essentiel pour nos hackers que le lancement des pi&egrave;ces de jeu soit coh&eacute;rent. Pour ce faire, le tireur devait &ecirc;tre stable sur le robot, ce qui &eacute;tait une t&acirc;che ardue &agrave; accomplir.</p>
      <p>Malgr&eacute; tous ces probl&egrave;mes, nos hackers ont pers&eacute;v&eacute;r&eacute; et ont trouv&eacute; des solutions pour accomplir la t&acirc;che qui leur a &eacute;t&eacute; assign&eacute;e. La premi&egrave;re solution &eacute;tait d&rsquo;ajouter une grande griffe m&eacute;canique. La deuxi&egrave;me &eacute;tait de monter des contrepoids. Finalement, notre &eacute;quipe a construit des supports personnalis&eacute;s afin de stabiliser les perceuses utilis&eacute;es pour le m&eacute;canisme de tir. </p>
    </div>
    <div class="footer", style="padding-top:50px">
      Nous sommes situ&eacute;s au 4873 Avenue Westmount &agrave; Westmount, notre groupe de hackers compte plus de 2 000 &eacute;tudiants faisant partie de plus de 150 clubs scolaires.
      <br>Marianopolis est un c&eacute;gep anglophone priv&eacute;.
       <br><a id = "footerLink" class = "footer" href = "../en/robot.html"> English </a>
    </div>
	</div>

  <div id="console", onmouseenter="scaleBox(event)", onmouseleave="scaleBox(event)">
		<div id="consoleArea"></div>
		<div id="cursor">|</div>
	</div>

  <script src="../js/RoboticsStuff.js"></script>
  <script>
    var width;
    var imgSize;
    function imgResize()
    {
      width=window.innerWidth;
      imgSize=width*0.47;
      document.getElementById("shooter").style.maxWidth=imgSize+"px";
      if ((imgSize*0.4)>360) {
        document.getElementById("whel").style.maxWidth=360+"px";
      } else {
        document.getElementById("whel").style.maxWidth=(imgSize*0.4)+"px";
      }
      document.getElementById("robotModel").style.height=(imgSize/1.6)+"px";
    }
  </script>

</body>
</html>
