<!DOCTYPE html>
<html>
<head>
    <title>Hacking Team</title>
    <link rel="stylesheet" type="text/css" href="../css/stylesheet.css">
    <link href="https://fonts.googleapis.com/css?family=Anonymous+Pro" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css?family=Inconsolata" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css?family=Bitter" rel="stylesheet">
    <link rel="shortcut icon" href="../media/favicon.png">
</head>
<body onload="resizeTeamPage();numberLines()", onresize="resizeTeamPage();numberLines()">
	<div id="numbar"></div>
	<div id="content">
		<p class="header">Meet Our Team</p>
    <p class="subHeader"><i> &lt!-- Lead Hackers --&gt</i> </p>
		<div id="peterBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="peter" src="../media/team/peter.png" width=200px>
				</div>
				<div id="peterBoxText" class="userName">@WoodworkerX71</div>
			</div>
			<div class="userContent">
        Je suis le capitaine de l&#39;&eacute;quipe et le seul menuisier. <br>
        J'ai ador&eacute; m'isoler des autres pour de longues s&eacute;ances de menuiserie intense qui se terminent toujours avec un BANG, mais j'ai moins aim&eacute; est de faire en sorte que Angus comprenne la s&eacute;curit&eacute; puisque le gars veut mourir.<br>
        Mon plus grand sacrifice a &eacute;t&eacute; un de mes ongles qui a cass&eacute; durant le travail et saviez vous que l'autre capitaine est seulement chatouilleuse sous ses pieds? <br>
      </div> </div>
      <div id="panayotaBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="panayota" src="../media/team/panayota.png" width=200px>
				</div>
				<div id="panayotaBoxText" class="userName">@panayots</div>
			</div>
			<div class="userContent">
          Je suis une des capitaines de l'&eacute;quipe. Ce que j'ai appr&eacute;ci&eacute; au sujet de l'&eacute;quipe de cette ann&eacute;e, c'est la fa&ccedil;on dont nous travaillons tous ensemble de fa&ccedil;on coh&eacute;sive. Nous avons consacr&eacute; un nombre incalculable d'heures de travail acharn&eacute; pour nous assurer que notre robot refl&egrave;te nos meilleures capacit&eacute;s, tout en trouvant le temps de s'amuser et de plaisanter, ce qui a permis de se faire plusieurs amis. Toutefois, ce que j'ai trouv&eacute; difficile, c'est d'apprendre &agrave; &ecirc;tre plus organis&eacute; pour &ecirc;tre capable d'&eacute;quilibrer toutes les responsabilit&eacute;s d'&ecirc;tre capitaine.<br />Mon plus grand sacrifice a &amp;eacute;t&amp;eacute; le fait que je me fais voler mes heures de sommeil chaque ann&eacute;e, mais &agrave; la fin &ccedil;a vallait la peine et saviez vous que j'ai une paire de bas Spongebob?
      </div>
    </div>

    <p class="subHeader"><i> &lt!-- Associate Hackers --&gt</i> <br><br> </p>
				<div id="aaronBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="aaron" src="../media/team/aaron.png" width=200px>
				</div>
				<div id="aaronBoxText" class="userName">@a-a-lohn</div>
			</div>
			<div class="userContent">
        Je travaille sur le kiosque et le robot.
        J'ai ador&eacute; construire des parties pour le robot et le kisoque en apprenant durant ce temps mais j'ai trouv&eacute; que se lever &agrave; 7:30 tous les matins &eacute;tait difficile<br>
        Mon plus grand sacrifice a &eacute;t&eacute; mon temps et mon sommeil et saviez vous que ce kangourou me fait gratter?
      </div>
		</div>
		<div id="benjaminBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="benjamin" src="../media/team/benjamin.png" width=200px>
				</div>
				<div id="benjaminBoxText" class="userName">@linuxUser</div>
			</div>
			<div class="userContent">
        <p>Je fais partie des &eacute;quipes de programmation, de site Web et de robot.</p>. <br>
        J&rsquo;ai vraiment aim&eacute; avoir eu l&rsquo;opportunit&eacute; d&rsquo;apprendre de nouvelles choses telles que la confection du site web. Avant d&rsquo;avoir commenc&eacute;, j&rsquo;ai seulement fait un peu de Javascript, mais je n&rsquo;ai jamais fait du CSS ou du HTML. Je me sens maintenant &agrave; l&rsquo;aise avec la mise en place du site web. J&rsquo;ai aussi aim&eacute; pourvoir programmer quelque chose de plus compliqu&eacute; qu&rsquo;une application. De plus, j&rsquo;adore rencontrer d&rsquo;autres personnes qui ont les m&ecirc;mes int&eacute;r&ecirc;ts que moi.
        Par contre, j&rsquo;ai trouv&eacute; difficile le fait d&rsquo;apprendre autant de chose en si peu de temps. Malgr&eacute; le fait que j&rsquo;ai aim&eacute; l&rsquo;exp&eacute;rience, c&rsquo;&eacute;tait vraiment un gros d&eacute;fi &agrave; assimiler pour moi. Respecter les dates limites pour remettre nos travaux a aussi &eacute;t&eacute; un grand d&eacute;fi selon moi.<br>
        En ce qui concerne les sacrifices, le principal a &eacute;t&eacute; de perdre le temps de mes vacances d'hiver. Cependant, puisque je serais probablement assis autour &agrave; ne rien faire, je ne consid&egrave;re pas cela comme un trop grand sacrifice.
        Et saviez vous que j&rsquo;utilise Linux sur mes ordinateurs (la programmation pour le robot devient tr&egrave;s amusante)? </div>		</div>
		<div id="georgeBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="george" src="../media/team/george.png" width=200px>
				</div>
				<div id="georgeBoxText" class="userName">@Ironman</div>
			</div>
			<div class="userContent">

        Je fais parti de l&#39;&eacute;quipe du robot. <br>
        J'ai ador&eacute; apprendre plus sur la machinerie et travailler dans un environnement amical avec du monde travaillant et d&eacute;termin&eacute;s<br>
        Mon plus grand sacrifice a &eacute;t&eacute; mon sommeil et saviez vous que mon nom de famille, Sideris, signifie L&rsquo;Homme de fer (Ironman) en grec (Sidero=Fer)?
 </div>		</div>
		<div id="thomasBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="thomas" src="../media/team/thomas.png" width=200px>
				</div>
				<div id="thomasBoxText" class="userName">@TRibs</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe du robot. <br>
        J'ai ador&eacute; l'apprentissage des diff&eacute;rentes m&eacute;thodes d'ing&eacute;nierie et des techniques qui sont n&eacute;cessaires pour construire efficacement un robot mais j'ai moins aim&eacute; la fusion de divers domaines d'ing&eacute;nierie interdisciplinaires pour assurer le succ&egrave;s du fonctionnement et de la construction du robot<br>
        Mon plus grand sacrifice a &eacute;t&eacute; mes dents de sagesse et saviez vous que je suis un alumni de l&rsquo;Expo-Science? </div>		</div>
		<div id="roeyBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="roey" src="../media/team/roey.png" width=200px>
				</div>
				<div id="roeyBoxText" class="userName">@ih8js</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe du robot, video et de kiosque. <br>
        J'ai  ador&eacute; !=Javascript et j'ai moins aim&eacute; Javascript<br>
        Je n'ai pas beaucoup sacrifi&eacute; pour l'&eacute;quipe de robotique et saviez vous que je hais Javascript ? </div>		</div>
		<div id="nicholasBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="nicholas" src="../media/team/nicholas.png" width=200px>
				</div>
				<div id="nicholasBoxText" class="userName">@WhosYourDahdah</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe de robot et de kiosque. <br>
        J'aime le fait que je suis capable d'apprendre des fa&ccedil;ons nouvelles et int&eacute;ressantes de r&eacute;soudre des probl&egrave;mes que j'ai par ailleurs trouv&eacute; impossibles &agrave; surmonter. J'ai vraiment appr&eacute;ci&eacute; travailler sur le kiosque, ce qui &eacute;tait une toute nouvelle t&acirc;che qui m'a permis d'&eacute;largir mes comp&eacute;tences pratiques et cr&eacute;atives. Cependant, arriver &agrave; travailler au m&ecirc;me niveau que les membres extr&ecirc;mement exp&eacute;riment&eacute;s de l&rsquo;&eacute;quipe a &eacute;t&eacute; un d&eacute;fi parce que parfois, je suis tout simplement hors de ma port&eacute;e et je ne peux pas contribuer autant que je le voudrais.<br>
        Mon plus grand sacrifice a &eacute;t&eacute; que mon horaire de &laquo; dormir jusqu'&agrave; 13 heure&raquo; a &eacute;t&eacute; l&eacute;g&egrave;rement interrompu par le flux de travail robotique.
        Et saviez vous que je peux disloquer ma m&acirc;choire comme un serpent, je trouve &ccedil;a assez cool! </div> </div>
        <div id="khadijaBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="khadija" src="../media/team/khadija.png" width=200px>
				</div>
				<div id="khadijaBoxText" class="userName">@TheSmallHuman</div>
			</div>
			<div class="userContent">

        I am part of the video <br>
        I enjoyed the creative process while I found working in high places difficult <br>
        Je fais parti de l&#39;&eacute;quipe de vid&eacute <br>
        J'ai ador&eacute; le proc&egrave;s cr&eacute;atif mais j'ai moins aim&eacute; travaillez dans un environnement lit. <br>
        Mon plus grand sacrifice a &eacute;t&eacute; me r&eacute;veiller &agrave; 7 am pour aller &agrave; l&rsquo;&eacute;cole durant mes vacances d&rsquo;hivers et saviez vous que Voldemort m&rsquo;a poss&eacute;d&eacute; et sa face vis au dos de ma t&ecirc;te.? </div> </div>
      <div id="charlesBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="charles" src="../media/team/charles.png" width=200px>
				</div>
				<div id="charlesBoxText" class="userName">@CharlieTheUnicorn</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe de kisoque, robot et vid&eacute;o.
        J'ai aimé rencontrer plusieurs personnes différentes et le genre qu'on ne rencontrerait jamais ailleurs sauf dans l'équipe de robotique. Le fait que je me suis réveillé tous les matins après deux semaines de vacances avec un horaire de sommeil horrible a &eacute;t&eacute difficile.
        Le plus grand sacrifice que j'ai fait c'est mon sommeil et saviez vous que je viens de Br&eacute;beuf?
      </div> </div>
		<div id="yuchenBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="yuchen" src="../media/team/yuchen.png" width=200px>
				</div>
				<div id="yuchenBoxText" class="userName">@Anon-he-mous</div>
			</div>
			<div class="userContent">
        Je travaille sur le kiosque, le robot et la programmation. <br>
        J'ai ador&eacute; construire le robot et le kisoque mais j’ai trouv&eacute; que la conception de bonnes id&eacute;es &eacute;tait difficile<br>
        Mon plus grand sacrifice a &eacute;t&eacute; la moiti&eacute; des vacances d’hiver et  ne pas pouvoir sortir avec des amis  et saviez vous que je souffre d’une d&eacutepression paralysante?			 </div>
		</div>
		<div id="mattBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="matt" src="../media/team/matt.png" width=200px>
				</div>
				<div id="mattBoxText" class="userName">@Grizzly_bear</div>
			</div>
			<div class="userContent">

        Je fais parti de l&#39;&eacute;quipe du robot. <br>
        J'ai ador&eacute; r&eacute;ussir &agrave; construire un lanceur qui ne blesse personne mais j'ai moins aim&eacute; trouver un moyen de faire monter le robot par-dessus la rampe assez raide<br>
        Mon plus grand sacrifice a &eacute;t&eacute; mes beaux temps au Mexique et saviez vous que JE SUIS UN OURS?!?!?! RAWR - Marissa <br> </div>		</div>
		<div id="saraBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="sara" src="../media/team/sara.png" width=200px>
				</div>
				<div id="saraBoxText" class="userName">@Saranwrawr</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe du robot. <br>
        J'ai ador&eacute; le travail d'&eacute;quipe, le processus de brainstorming, plaisanter avec les gens et juste profiter de travailler dans une bonne ambiance avec de la musique&hellip;plut&ocirc;t unique, mais j'ai moins aim&eacute; ma petite voix dans un groupe de personnes intelligentes. <br>
        Mon plus grand sacrifice a &eacute;t&eacute; le temps pour arriver &agrave Marianopolis et saviez vous que j&rsquo;ai des bras vraiment longs? </div> </div>
      <div id="angusBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="angus" src="../media/team/angus.png" width=200px>
				</div>
				<div id="angusBoxText" class="userName">@AllanIV</div>
			</div>
			<div class="userContent">
        e fais parti de l&#39;&eacute;quipe de robot et kiosque. <br>
        J'ai ador&eacute; que nous avons une &eacute;quipe incroyable qui avec laquelle le travail semble amusant, mais j'ai moins aim&eacute; nettoyer<br>
        Oui, mes mains ont pris en feu, je me suis poignard&eacute; avec une lime et mon assurance ne couvre probablement pas la moiti&eacute; des choses que je fais. Et saviez vous que mon nom n&rsquo;est pas Angus? </div>		</div>
				<div id="simonBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="simon" src="../media/team/simon.png" width=200px>
				</div>
				<div id="simonBoxText" class="userName">@Hacker_boi</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe de programmation. <br>
        J&rsquo;adore robotique parce que &ccedil;a me permet de faire des choses que je n&rsquo;aurais pas l&rsquo;opportunit&eacute; de faire normalement. Par contre, le défi a été de travailler sur plusieurs sous-groupes en même temps. Cependant, nous avons réussi à relever le défi une fois que notre équipe s’est renforcée. <br>
        Mon plus grand sacrifice a &eacute;t&eacute; Eehhhmmm, seulement mes vacances compl&egrave;tes et saviez vous que j&rsquo;ai plus de bras que la moyenne? </div>		</div>
				<div id="edwinBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="edwin" src="../media/team/edwin.png" width=200px>
				</div>
				<div id="edwinBoxText" class="userName">@Agent_Bennette</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe de robot et de kiosque. <br>
        J'ai ador&eacute; robotique et les gens en robotique.<br>
        Mon plus grand sacrifice a &eacute;t&eacute; mon temps, mon effort, mon travail et mes ressources et saviez vous que je poss&egrave;de une couple d&rsquo;imprimantes 3D? </div> </div>
        <div id="ruiBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="rui" src="../media/team/rui.png" width=200px>
				</div>
				<div id="ruiBoxText" class="userName">@LonelyHacker</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe du groupe de robot, kiosque et pseudo-programmation. <br>
        J'ai ador&eacute; construire des objets, mais plus sp&eacute;cifiquement comp&eacute;titionner avec d&rsquo;autres membres dans l&rsquo;&eacute;quipe pour voir qui est celui qui finis en premier, mais j'ai moins aim&eacute; trouver des id&eacute;es pour la conception et la construction du kiosque<br>
        Mon plus grand sacrifice a &eacute;t&eacute; mes vacances d&rsquo;hiver au complet et mon sommeil et saviez vous que Peter aime d&rsquo;&ecirc;tre assis dessus ? </div>		</div>
				<div id="conradBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="conrad" src="../media/team/conrad.png" width=200px>
				</div>
				<div id="conradBoxText" class="userName">@MrThatGuy</div>
				</div>
			<div class="userContent">
        Je fais partie des &eacute;quipes vid&eacute;o, robot, pseudo programmation et kiosque. <br>
        J'ai ador&eacute; la chance d'am&eacute;liorer mes comp&eacute;tences dans la construction d'un robot, d'un kiosque et d'autres choses en &eacute;quipe. Les comp&eacute;tences de communication sont n&eacute;cessaires.
        mais j'ai moins aim&eacute;Communiquer efficacement avec les membres de mon &eacute;quipe dans diff&eacute;rentes sections de l'&eacute;quipe, car nous ne sommes pas toujours sur la m&ecirc;me longueur d'onde.  </div>		</div>
		<div id="marissaBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="marissa" src="../media/team/marissa.png" width=200px>
				</div>
				<div id="marissaBoxText" class="userName">@hatzi_hero</div>
			</div>
			<div class="userContent">
        Je fais parti de l&#39;&eacute;quipe du vid&eacute;o, kiosque, cite web et journal. <br>
        J'ai ador&eacute; travailler dans le kiosk et &eacute;crire pour robotique mais j'ai moins aim&eacute; me r&eacute;veiller pour venir &agrave; l&rsquo;&eacute;cole et travailler<br>
        Mon plus grand sacrifice a &eacute;t&eacute; mon temps et saviez vous que je patine? </div>	</div>
			<div id="feiBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="fei" src="../media/team/fei.png" width=200px>
				</div>
				<div id="feiBoxText" class="userName">@rainbounikorn</div>
			</div>
			<div class="userContent">

        Je fais parti de l&#39;&eacute;quipe de video. <br>
        J'ai ador&eacute; travailler avec une &eacute;quipe vraiment cool mais j'ai moins aim&eacute; atteindre la perfection<br>
        Mon plus grand sacrifice a &eacute;t&eacute; Mon temps, mon &eacute;nergie, mon sang, ma sueur et mes larmes. Cependant, &ccedil;a valait la peine !
        Et saviez vous que je sais parler 5 langues (Mandarin, Espagnol, Anglais, Allemand, Français)? </div>	</div>
    <p class="subHeader"><i> &lt!-- Hacking Mentors --&gt</i> <br><br> </p>
				<div id="paradisBox", class="teamInfoLeft", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="paradis" src="../media/team/paradis.png" width=200px>
				</div>
				<div id="paradisBoxText" class="userName">@Robowalker</div>
			</div>
			<div class="userContent">
			 Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nunc maximus neque at ante consequat lacinia. Aenean nec gravida sem. Proin vel ante tellus. Nullam cursus laoreet varius. Interdum et malesuada fames ac ante ipsum primis in faucibus. Aenean consequat, massa eget facilisis imperdiet, tellus neque pharetra nunc, et aliquam diam tortor in ante. Phasellus ornare lorem purus, rutrum pellentesque sapien dapibus eget.			</div>
		</div>
		<div id="hadiBox", class="teamInfoRight", onmouseover="setGIF(id)", onmouseleave="setJPG(id)", onload="setJPG(id)">
			<div class="userNameAndImage">
				<div class="userImage">
					<img id="hadi" src="../media/team/hadi.png" width=200px>
				</div>
				<div id="hadiBoxText" class="userName">@Robadi</div>
			</div>
			<div class="userContent">
			 Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nunc maximus neque at ante consequat lacinia. Aenean nec gravida sem. Proin vel ante tellus. Nullam cursus laoreet varius. Interdum et malesuada fames ac ante ipsum primis in faucibus. Aenean consequat, massa eget facilisis imperdiet, tellus neque pharetra nunc, et aliquam diam tortor in ante. Phasellus ornare lorem purus, rutrum pellentesque sapien dapibus eget. Aenean convallis varius finibus. Fusce in lacinia urna. Vivamus imperdiet tellus sodales eros volutpat, et hendrerit justo volutpat. Nullam eget lacus eget odio pretium lacinia pellentesque faucibus nisi.
			</div>
    </div>
    <div class="footer", style="padding-top:50px">
      Nous sommes situ&eacute;s au 4873 Avenue Westmount &agrave; Westmount, notre groupe de hackers compte plus de 2 000 &eacute;tudiants faisant partie de plus de 150 clubs scolaires.
      <br>Marianopolis est un c&eacute;gep anglophone priv&eacute;.
       <br><a id = "footerLink" class = "footer" href = "../en/team.html"> English </a>
		</div>
			</div>
	<div id="console", onmouseenter="scaleBox(event)", onmouseleave="scaleBox(event)">
		<div id="consoleArea"></div>
		<div id="cursor">|</div>
	</div>
	<script src="../js/RoboticsStuff.js"></script>
	<script>
	var teamMembers=[
			{ id:		"peter",
			  name: 	"@PeterKaloyannis",
			  hackName: "@WoodworkerX71"
			},
			{id:		"panayota",
			 name:		"@PanayotaMariaGiannota",
			 hackName: "@panayots"
			 },
			{id:		"simon",
			 name:		"@SimonTartakovsky",
			 hackName:	"@Hacker_boi"
			},
			{id:		"edwin",
			 name:		"@EdwinPan",
			 hackName:	"@Agent_Bennette"
			},
			{id:		"conrad",
			 name:		"@ConradWinton",
			 hackName:	"@MrThatGuy"
			},
			{id:		"angus",
			 name:		"@AngusAitken",
			 hackName:	"@AllanIV"
			},
			{id:		"thomas",
			 name:		"@ThomasRibeiro",
			 hackName:	"@TRibs"
			},
			{id:		"rui",
			 name:		"@RuiHengYang",
			 hackName:	"@LonelyHacker"
			},
			{id:		"fei",
			 name:		"@FeiRuiLong",
			 hackName:	"@rainbounikorn"
			},
			{id:		"khadija",
			 name:		"@KhadijaBegum",
			 hackName:	"@TheSmallHuman"
			},
			{id:		"sara",
			 name:		"@SaraAnwar",
			 hackName:	"@Saranwrawr"
			},
			{id:		"george",
			 name:		"@GeorgeSideris",
			 hackName:	"@Ironman"
			},
			{id:		"nicholas",
			 name:		"@NicholasDahdah",
			 hackName:	"@WhosYourDahdah"
			},
			{id:		"charles",
			 name:		"@CharlesDavid",
			 hackName:	"@CharlieTheUnicorn"
			},
			{id:		"marissa",
			 name:		"@MarissaHatzigeoriou",
			 hackName:	"@hatzi_hero"
			},
			{id:		"matt",
			 name:		"@MattBehr",
			 hackName:	"@Grizzly_bear"
			},
			{id:		"roey",
			 name:		"@RoeyBorsteinas",
			 hackName:	"@ih8js"
			},
			{id:		"benjamin",
			 name:		"@BenjaminRudski",
			 hackName:	"@linuxUser"
			},
			{id:		"aaron",
			 name:		"@AaronLohner",
			 hackName:	"@a-a-lohn"
			},
			{id:		"yuchen",
			 name:		"@YuChenHe",
			 hackName:	"@Anon-he-mous"
			},
			{id:		"paradis",
			 name:		"@DominiqueParadis",
			 hackName:	"@Robowalker"
			},
			{id:		"hadi",
			 name:		"@HadiBigdely",
			 hackName:	"@Robadi"
			}
			];

	function getTeamMemberById(id){
		var selectedTeamMember;
		for (var i=0; i<teamMembers.length; i++){
			if (id==teamMembers[i].id){
				selectedTeamMember=teamMembers[i];
				break;
			}
			else continue;
		}

		return selectedTeamMember;
	}
	function setGIF(id){
		var imgId=id.slice(0,-3);
		document.getElementById(imgId).src=`../media/team/${imgId}.gif`;

		var textId=id+"Text";
		var teamMember=getTeamMemberById(imgId);
		document.getElementById(textId).innerHTML=teamMember.name;
	}
	function setJPG(id){
		var imgId=id.slice(0,-3);
		document.getElementById(imgId).src=`../media/team/${imgId}.png`;

		var textId=id+"Text";
		var teamMember=getTeamMemberById(imgId);
		document.getElementById(textId).innerHTML=teamMember.hackName;
	}
	</script>

	<script src="../js/resize.js"></script>
</body>
</html>
